Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_sg01_cult/pic32ck_sg01_cult_tz_getting_started/firmware/src/packs/PIC32CK2051SG01144_DFP/component/fcw.h
/*
 * Component description for FCW
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2023-11-16T06:44:02Z */
#ifndef _PIC32CKSG01_FCW_COMPONENT_H_
#define _PIC32CKSG01_FCW_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR FCW                                          */
/* ************************************************************************** */

/* -------- FCW_CTRLA : (FCW Offset: 0x00) (R/W 32) NVM Write Control Register -------- */
#define FCW_CTRLA_RESETVALUE                  _UINT32_(0x00)                                       /*  (FCW_CTRLA) NVM Write Control Register  Reset Value */

#define FCW_CTRLA_NVMOP_Pos                   _UINT32_(0)                                          /* (FCW_CTRLA) NVM Operation Position */
#define FCW_CTRLA_NVMOP_Msk                   (_UINT32_(0xF) << FCW_CTRLA_NVMOP_Pos)               /* (FCW_CTRLA) NVM Operation Mask */
#define FCW_CTRLA_NVMOP(value)                (FCW_CTRLA_NVMOP_Msk & (_UINT32_(value) << FCW_CTRLA_NVMOP_Pos)) /* Assigment of value for NVMOP in the FCW_CTRLA register */
#define FCW_CTRLA_PREPG_Pos                   _UINT32_(7)                                          /* (FCW_CTRLA) NVM Pre-Program Configuration Bit Position */
#define FCW_CTRLA_PREPG_Msk                   (_UINT32_(0x1) << FCW_CTRLA_PREPG_Pos)               /* (FCW_CTRLA) NVM Pre-Program Configuration Bit Mask */
#define FCW_CTRLA_PREPG(value)                (FCW_CTRLA_PREPG_Msk & (_UINT32_(value) << FCW_CTRLA_PREPG_Pos)) /* Assigment of value for PREPG in the FCW_CTRLA register */
#define FCW_CTRLA_Msk                         _UINT32_(0x0000008F)                                 /* (FCW_CTRLA) Register Mask  */


/* -------- FCW_CTRLB : (FCW Offset: 0x04) (R/W 32) NVM Control B Register -------- */
#define FCW_CTRLB_RESETVALUE                  _UINT32_(0xFF)                                       /*  (FCW_CTRLB) NVM Control B Register  Reset Value */

#define FCW_CTRLB_SDALCPU0_Pos                _UINT32_(0)                                          /* (FCW_CTRLB) Set DAL for CPU n Position */
#define FCW_CTRLB_SDALCPU0_Msk                (_UINT32_(0x3) << FCW_CTRLB_SDALCPU0_Pos)            /* (FCW_CTRLB) Set DAL for CPU n Mask */
#define FCW_CTRLB_SDALCPU0(value)             (FCW_CTRLB_SDALCPU0_Msk & (_UINT32_(value) << FCW_CTRLB_SDALCPU0_Pos)) /* Assigment of value for SDALCPU0 in the FCW_CTRLB register */
#define FCW_CTRLB_SDALCPU1_Pos                _UINT32_(2)                                          /* (FCW_CTRLB) Set DAL for CPU n Position */
#define FCW_CTRLB_SDALCPU1_Msk                (_UINT32_(0x3) << FCW_CTRLB_SDALCPU1_Pos)            /* (FCW_CTRLB) Set DAL for CPU n Mask */
#define FCW_CTRLB_SDALCPU1(value)             (FCW_CTRLB_SDALCPU1_Msk & (_UINT32_(value) << FCW_CTRLB_SDALCPU1_Pos)) /* Assigment of value for SDALCPU1 in the FCW_CTRLB register */
#define FCW_CTRLB_SDALCPU2_Pos                _UINT32_(4)                                          /* (FCW_CTRLB) Set DAL for CPU n Position */
#define FCW_CTRLB_SDALCPU2_Msk                (_UINT32_(0x3) << FCW_CTRLB_SDALCPU2_Pos)            /* (FCW_CTRLB) Set DAL for CPU n Mask */
#define FCW_CTRLB_SDALCPU2(value)             (FCW_CTRLB_SDALCPU2_Msk & (_UINT32_(value) << FCW_CTRLB_SDALCPU2_Pos)) /* Assigment of value for SDALCPU2 in the FCW_CTRLB register */
#define FCW_CTRLB_SDALCPU3_Pos                _UINT32_(6)                                          /* (FCW_CTRLB) Set DAL for CPU n Position */
#define FCW_CTRLB_SDALCPU3_Msk                (_UINT32_(0x3) << FCW_CTRLB_SDALCPU3_Pos)            /* (FCW_CTRLB) Set DAL for CPU n Mask */
#define FCW_CTRLB_SDALCPU3(value)             (FCW_CTRLB_SDALCPU3_Msk & (_UINT32_(value) << FCW_CTRLB_SDALCPU3_Pos)) /* Assigment of value for SDALCPU3 in the FCW_CTRLB register */
#define FCW_CTRLB_Msk                         _UINT32_(0x000000FF)                                 /* (FCW_CTRLB) Register Mask  */


/* -------- FCW_MUTEX : (FCW Offset: 0x08) (R/W 32) NVM MUTEX Register -------- */
#define FCW_MUTEX_RESETVALUE                  _UINT32_(0x00)                                       /*  (FCW_MUTEX) NVM MUTEX Register  Reset Value */

#define FCW_MUTEX_LOCK_Pos                    _UINT32_(0)                                          /* (FCW_MUTEX) Flash Write Controller (FCW) Lock by Owner Position */
#define FCW_MUTEX_LOCK_Msk                    (_UINT32_(0x1) << FCW_MUTEX_LOCK_Pos)                /* (FCW_MUTEX) Flash Write Controller (FCW) Lock by Owner Mask */
#define FCW_MUTEX_LOCK(value)                 (FCW_MUTEX_LOCK_Msk & (_UINT32_(value) << FCW_MUTEX_LOCK_Pos)) /* Assigment of value for LOCK in the FCW_MUTEX register */
#define FCW_MUTEX_OWNER_Pos                   _UINT32_(1)                                          /* (FCW_MUTEX) Flash Write Controller (FCW) Owner ID Position */
#define FCW_MUTEX_OWNER_Msk                   (_UINT32_(0x3) << FCW_MUTEX_OWNER_Pos)               /* (FCW_MUTEX) Flash Write Controller (FCW) Owner ID Mask */
#define FCW_MUTEX_OWNER(value)                (FCW_MUTEX_OWNER_Msk & (_UINT32_(value) << FCW_MUTEX_OWNER_Pos)) /* Assigment of value for OWNER in the FCW_MUTEX register */
#define FCW_MUTEX_Msk                         _UINT32_(0x00000007)                                 /* (FCW_MUTEX) Register Mask  */


/* -------- FCW_INTENCLR : (FCW Offset: 0x0C) (R/W 32) NVM Interrupt Enable Clear Register -------- */
#define FCW_INTENCLR_RESETVALUE               _UINT32_(0x00)                                       /*  (FCW_INTENCLR) NVM Interrupt Enable Clear Register  Reset Value */

#define FCW_INTENCLR_DONE_Pos                 _UINT32_(0)                                          /* (FCW_INTENCLR) NVM Operation Done Interrupt Enable Bit Position */
#define FCW_INTENCLR_DONE_Msk                 (_UINT32_(0x1) << FCW_INTENCLR_DONE_Pos)             /* (FCW_INTENCLR) NVM Operation Done Interrupt Enable Bit Mask */
#define FCW_INTENCLR_DONE(value)              (FCW_INTENCLR_DONE_Msk & (_UINT32_(value) << FCW_INTENCLR_DONE_Pos)) /* Assigment of value for DONE in the FCW_INTENCLR register */
#define FCW_INTENCLR_KEYERR_Pos               _UINT32_(1)                                          /* (FCW_INTENCLR) Key Error Interrupt Enable Bit Position */
#define FCW_INTENCLR_KEYERR_Msk               (_UINT32_(0x1) << FCW_INTENCLR_KEYERR_Pos)           /* (FCW_INTENCLR) Key Error Interrupt Enable Bit Mask */
#define FCW_INTENCLR_KEYERR(value)            (FCW_INTENCLR_KEYERR_Msk & (_UINT32_(value) << FCW_INTENCLR_KEYERR_Pos)) /* Assigment of value for KEYERR in the FCW_INTENCLR register */
#define FCW_INTENCLR_CFGERR_Pos               _UINT32_(2)                                          /* (FCW_INTENCLR) Configuration Error Interrupt Enable Bit Position */
#define FCW_INTENCLR_CFGERR_Msk               (_UINT32_(0x1) << FCW_INTENCLR_CFGERR_Pos)           /* (FCW_INTENCLR) Configuration Error Interrupt Enable Bit Mask */
#define FCW_INTENCLR_CFGERR(value)            (FCW_INTENCLR_CFGERR_Msk & (_UINT32_(value) << FCW_INTENCLR_CFGERR_Pos)) /* Assigment of value for CFGERR in the FCW_INTENCLR register */
#define FCW_INTENCLR_FIFOERR_Pos              _UINT32_(3)                                          /* (FCW_INTENCLR) FIFO Underrun during Row Write Interrupt Enable Bit Position */
#define FCW_INTENCLR_FIFOERR_Msk              (_UINT32_(0x1) << FCW_INTENCLR_FIFOERR_Pos)          /* (FCW_INTENCLR) FIFO Underrun during Row Write Interrupt Enable Bit Mask */
#define FCW_INTENCLR_FIFOERR(value)           (FCW_INTENCLR_FIFOERR_Msk & (_UINT32_(value) << FCW_INTENCLR_FIFOERR_Pos)) /* Assigment of value for FIFOERR in the FCW_INTENCLR register */
#define FCW_INTENCLR_BUSERR_Pos               _UINT32_(4)                                          /* (FCW_INTENCLR) AHB Bus Error during Row Write Interrupt Enable Bit Position */
#define FCW_INTENCLR_BUSERR_Msk               (_UINT32_(0x1) << FCW_INTENCLR_BUSERR_Pos)           /* (FCW_INTENCLR) AHB Bus Error during Row Write Interrupt Enable Bit Mask */
#define FCW_INTENCLR_BUSERR(value)            (FCW_INTENCLR_BUSERR_Msk & (_UINT32_(value) << FCW_INTENCLR_BUSERR_Pos)) /* Assigment of value for BUSERR in the FCW_INTENCLR register */
#define FCW_INTENCLR_WPERR_Pos                _UINT32_(5)                                          /* (FCW_INTENCLR) Write Protection Error Interrupt Enable Bit Position */
#define FCW_INTENCLR_WPERR_Msk                (_UINT32_(0x1) << FCW_INTENCLR_WPERR_Pos)            /* (FCW_INTENCLR) Write Protection Error Interrupt Enable Bit Mask */
#define FCW_INTENCLR_WPERR(value)             (FCW_INTENCLR_WPERR_Msk & (_UINT32_(value) << FCW_INTENCLR_WPERR_Pos)) /* Assigment of value for WPERR in the FCW_INTENCLR register */
#define FCW_INTENCLR_OPERR_Pos                _UINT32_(6)                                          /* (FCW_INTENCLR) NVMOP Error Interrupt Enable Bit Position */
#define FCW_INTENCLR_OPERR_Msk                (_UINT32_(0x1) << FCW_INTENCLR_OPERR_Pos)            /* (FCW_INTENCLR) NVMOP Error Interrupt Enable Bit Mask */
#define FCW_INTENCLR_OPERR(value)             (FCW_INTENCLR_OPERR_Msk & (_UINT32_(value) << FCW_INTENCLR_OPERR_Pos)) /* Assigment of value for OPERR in the FCW_INTENCLR register */
#define FCW_INTENCLR_SECERR_Pos               _UINT32_(7)                                          /* (FCW_INTENCLR) Security Violation Error Interrupt Enable Bit Position */
#define FCW_INTENCLR_SECERR_Msk               (_UINT32_(0x1) << FCW_INTENCLR_SECERR_Pos)           /* (FCW_INTENCLR) Security Violation Error Interrupt Enable Bit Mask */
#define FCW_INTENCLR_SECERR(value)            (FCW_INTENCLR_SECERR_Msk & (_UINT32_(value) << FCW_INTENCLR_SECERR_Pos)) /* Assigment of value for SECERR in the FCW_INTENCLR register */
#define FCW_INTENCLR_HTDPGM_Pos               _UINT32_(8)                                          /* (FCW_INTENCLR) High Temperature Detect Error Interrupt Enable Bit Position */
#define FCW_INTENCLR_HTDPGM_Msk               (_UINT32_(0x1) << FCW_INTENCLR_HTDPGM_Pos)           /* (FCW_INTENCLR) High Temperature Detect Error Interrupt Enable Bit Mask */
#define FCW_INTENCLR_HTDPGM(value)            (FCW_INTENCLR_HTDPGM_Msk & (_UINT32_(value) << FCW_INTENCLR_HTDPGM_Pos)) /* Assigment of value for HTDPGM in the FCW_INTENCLR register */
#define FCW_INTENCLR_BORERR_Pos               _UINT32_(12)                                         /* (FCW_INTENCLR) Brown Out Detect Error Interrupt Enable Bit Position */
#define FCW_INTENCLR_BORERR_Msk               (_UINT32_(0x1) << FCW_INTENCLR_BORERR_Pos)           /* (FCW_INTENCLR) Brown Out Detect Error Interrupt Enable Bit Mask */
#define FCW_INTENCLR_BORERR(value)            (FCW_INTENCLR_BORERR_Msk & (_UINT32_(value) << FCW_INTENCLR_BORERR_Pos)) /* Assigment of value for BORERR in the FCW_INTENCLR register */
#define FCW_INTENCLR_WRERR_Pos                _UINT32_(13)                                         /* (FCW_INTENCLR) Write Error Interrupt Enable Bit Position */
#define FCW_INTENCLR_WRERR_Msk                (_UINT32_(0x1) << FCW_INTENCLR_WRERR_Pos)            /* (FCW_INTENCLR) Write Error Interrupt Enable Bit Mask */
#define FCW_INTENCLR_WRERR(value)             (FCW_INTENCLR_WRERR_Msk & (_UINT32_(value) << FCW_INTENCLR_WRERR_Pos)) /* Assigment of value for WRERR in the FCW_INTENCLR register */
#define FCW_INTENCLR_Msk                      _UINT32_(0x000031FF)                                 /* (FCW_INTENCLR) Register Mask  */


/* -------- FCW_INTENSET : (FCW Offset: 0x10) (R/W 32) NVM Interrupt Enable SET Register -------- */
#define FCW_INTENSET_RESETVALUE               _UINT32_(0x00)                                       /*  (FCW_INTENSET) NVM Interrupt Enable SET Register  Reset Value */

