Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_sg01_cult/pic32ck_sg01_cult_tz_getting_started/firmware/src/packs/PIC32CK2051SG01144_DFP/component/fcw.h
/* -------- FCW_UBWP : (FCW Offset: 0x70) (R/W 32) Upper BFM Write Protect Register -------- */
#define FCW_UBWP_RESETVALUE                   _UINT32_(0xFFFF)                                     /*  (FCW_UBWP) Upper BFM Write Protect Register  Reset Value */

#define FCW_UBWP_UBWP_Pos                     _UINT32_(0)                                          /* (FCW_UBWP) Upper Boot Pages Write Protect Bits Position */
#define FCW_UBWP_UBWP_Msk                     (_UINT32_(0xFFFF) << FCW_UBWP_UBWP_Pos)              /* (FCW_UBWP) Upper Boot Pages Write Protect Bits Mask */
#define FCW_UBWP_UBWP(value)                  (FCW_UBWP_UBWP_Msk & (_UINT32_(value) << FCW_UBWP_UBWP_Pos)) /* Assigment of value for UBWP in the FCW_UBWP register */
#define FCW_UBWP_UBWPLOCK_Pos                 _UINT32_(31)                                         /* (FCW_UBWP) UBWP Register Lock Bit Position */
#define FCW_UBWP_UBWPLOCK_Msk                 (_UINT32_(0x1) << FCW_UBWP_UBWPLOCK_Pos)             /* (FCW_UBWP) UBWP Register Lock Bit Mask */
#define FCW_UBWP_UBWPLOCK(value)              (FCW_UBWP_UBWPLOCK_Msk & (_UINT32_(value) << FCW_UBWP_UBWPLOCK_Pos)) /* Assigment of value for UBWPLOCK in the FCW_UBWP register */
#define FCW_UBWP_Msk                          _UINT32_(0x8000FFFF)                                 /* (FCW_UBWP) Register Mask  */


/* -------- FCW_UOWP : (FCW Offset: 0x74) (R/W 32) User OTP Write Protect Register -------- */
#define FCW_UOWP_RESETVALUE                   _UINT32_(0xF0F)                                      /*  (FCW_UOWP) User OTP Write Protect Register  Reset Value */

#define FCW_UOWP_UO1WP_Pos                    _UINT32_(0)                                          /* (FCW_UOWP) User OTP Page 1 Write Protect Row Bit Position */
#define FCW_UOWP_UO1WP_Msk                    (_UINT32_(0xF) << FCW_UOWP_UO1WP_Pos)                /* (FCW_UOWP) User OTP Page 1 Write Protect Row Bit Mask */
#define FCW_UOWP_UO1WP(value)                 (FCW_UOWP_UO1WP_Msk & (_UINT32_(value) << FCW_UOWP_UO1WP_Pos)) /* Assigment of value for UO1WP in the FCW_UOWP register */
#define FCW_UOWP_UO2WP_Pos                    _UINT32_(8)                                          /* (FCW_UOWP) User OTP Page 2 Write Protect Row Bit Position */
#define FCW_UOWP_UO2WP_Msk                    (_UINT32_(0xF) << FCW_UOWP_UO2WP_Pos)                /* (FCW_UOWP) User OTP Page 2 Write Protect Row Bit Mask */
#define FCW_UOWP_UO2WP(value)                 (FCW_UOWP_UO2WP_Msk & (_UINT32_(value) << FCW_UOWP_UO2WP_Pos)) /* Assigment of value for UO2WP in the FCW_UOWP register */
#define FCW_UOWP_UO1WPRLOCK_Pos               _UINT32_(16)                                         /* (FCW_UOWP) User OTP Page 1 WP Row Lock Bit Position */
#define FCW_UOWP_UO1WPRLOCK_Msk               (_UINT32_(0xF) << FCW_UOWP_UO1WPRLOCK_Pos)           /* (FCW_UOWP) User OTP Page 1 WP Row Lock Bit Mask */
#define FCW_UOWP_UO1WPRLOCK(value)            (FCW_UOWP_UO1WPRLOCK_Msk & (_UINT32_(value) << FCW_UOWP_UO1WPRLOCK_Pos)) /* Assigment of value for UO1WPRLOCK in the FCW_UOWP register */
#define FCW_UOWP_UO2WPRLOCK_Pos               _UINT32_(24)                                         /* (FCW_UOWP) User OTP Page 2 WP Row Lock Bit Position */
#define FCW_UOWP_UO2WPRLOCK_Msk               (_UINT32_(0xF) << FCW_UOWP_UO2WPRLOCK_Pos)           /* (FCW_UOWP) User OTP Page 2 WP Row Lock Bit Mask */
#define FCW_UOWP_UO2WPRLOCK(value)            (FCW_UOWP_UO2WPRLOCK_Msk & (_UINT32_(value) << FCW_UOWP_UO2WPRLOCK_Pos)) /* Assigment of value for UO2WPRLOCK in the FCW_UOWP register */
#define FCW_UOWP_Msk                          _UINT32_(0x0F0F0F0F)                                 /* (FCW_UOWP) Register Mask  */


/* -------- FCW_CWP : (FCW Offset: 0x78) (R/W 32) CFM Page Write Protect Register -------- */
#define FCW_CWP_RESETVALUE                    _UINT32_(0x505)                                      /*  (FCW_CWP) CFM Page Write Protect Register  Reset Value */

#define FCW_CWP_UC1WP_Pos                     _UINT32_(0)                                          /* (FCW_CWP) User Configuration Page 1 Write Protect Bit Position */
#define FCW_CWP_UC1WP_Msk                     (_UINT32_(0x1) << FCW_CWP_UC1WP_Pos)                 /* (FCW_CWP) User Configuration Page 1 Write Protect Bit Mask */
#define FCW_CWP_UC1WP(value)                  (FCW_CWP_UC1WP_Msk & (_UINT32_(value) << FCW_CWP_UC1WP_Pos)) /* Assigment of value for UC1WP in the FCW_CWP register */
#define FCW_CWP_BC1WP_Pos                     _UINT32_(2)                                          /* (FCW_CWP) Boot Configuration Page 1 Write Protect Bit Position */
#define FCW_CWP_BC1WP_Msk                     (_UINT32_(0x1) << FCW_CWP_BC1WP_Pos)                 /* (FCW_CWP) Boot Configuration Page 1 Write Protect Bit Mask */
#define FCW_CWP_BC1WP(value)                  (FCW_CWP_BC1WP_Msk & (_UINT32_(value) << FCW_CWP_BC1WP_Pos)) /* Assigment of value for BC1WP in the FCW_CWP register */
#define FCW_CWP_UC2WP_Pos                     _UINT32_(8)                                          /* (FCW_CWP) User Configuration Page 2 Write Protect Bit Position */
#define FCW_CWP_UC2WP_Msk                     (_UINT32_(0x1) << FCW_CWP_UC2WP_Pos)                 /* (FCW_CWP) User Configuration Page 2 Write Protect Bit Mask */
#define FCW_CWP_UC2WP(value)                  (FCW_CWP_UC2WP_Msk & (_UINT32_(value) << FCW_CWP_UC2WP_Pos)) /* Assigment of value for UC2WP in the FCW_CWP register */
#define FCW_CWP_BC2WP_Pos                     _UINT32_(10)                                         /* (FCW_CWP) Boot Configuration Page 2 Write Protect Bit Position */
#define FCW_CWP_BC2WP_Msk                     (_UINT32_(0x1) << FCW_CWP_BC2WP_Pos)                 /* (FCW_CWP) Boot Configuration Page 2 Write Protect Bit Mask */
#define FCW_CWP_BC2WP(value)                  (FCW_CWP_BC2WP_Msk & (_UINT32_(value) << FCW_CWP_BC2WP_Pos)) /* Assigment of value for BC2WP in the FCW_CWP register */
#define FCW_CWP_UC1WPLOCK_Pos                 _UINT32_(16)                                         /* (FCW_CWP) User Configuration Page 1 WP Lock Bit Position */
#define FCW_CWP_UC1WPLOCK_Msk                 (_UINT32_(0x1) << FCW_CWP_UC1WPLOCK_Pos)             /* (FCW_CWP) User Configuration Page 1 WP Lock Bit Mask */
#define FCW_CWP_UC1WPLOCK(value)              (FCW_CWP_UC1WPLOCK_Msk & (_UINT32_(value) << FCW_CWP_UC1WPLOCK_Pos)) /* Assigment of value for UC1WPLOCK in the FCW_CWP register */
#define FCW_CWP_BC1WPLOCK_Pos                 _UINT32_(18)                                         /* (FCW_CWP) Boot Configuration Page 1 WP Lock Bit Position */
#define FCW_CWP_BC1WPLOCK_Msk                 (_UINT32_(0x1) << FCW_CWP_BC1WPLOCK_Pos)             /* (FCW_CWP) Boot Configuration Page 1 WP Lock Bit Mask */
#define FCW_CWP_BC1WPLOCK(value)              (FCW_CWP_BC1WPLOCK_Msk & (_UINT32_(value) << FCW_CWP_BC1WPLOCK_Pos)) /* Assigment of value for BC1WPLOCK in the FCW_CWP register */
#define FCW_CWP_UC2WPLOCK_Pos                 _UINT32_(24)                                         /* (FCW_CWP) User Configuration Page 2 WP Lock Bit Position */
#define FCW_CWP_UC2WPLOCK_Msk                 (_UINT32_(0x1) << FCW_CWP_UC2WPLOCK_Pos)             /* (FCW_CWP) User Configuration Page 2 WP Lock Bit Mask */
#define FCW_CWP_UC2WPLOCK(value)              (FCW_CWP_UC2WPLOCK_Msk & (_UINT32_(value) << FCW_CWP_UC2WPLOCK_Pos)) /* Assigment of value for UC2WPLOCK in the FCW_CWP register */
#define FCW_CWP_BC2WPLOCK_Pos                 _UINT32_(26)                                         /* (FCW_CWP) Boot Configuration Page 2 WP Lock Bit Position */
#define FCW_CWP_BC2WPLOCK_Msk                 (_UINT32_(0x1) << FCW_CWP_BC2WPLOCK_Pos)             /* (FCW_CWP) Boot Configuration Page 2 WP Lock Bit Mask */
#define FCW_CWP_BC2WPLOCK(value)              (FCW_CWP_BC2WPLOCK_Msk & (_UINT32_(value) << FCW_CWP_BC2WPLOCK_Pos)) /* Assigment of value for BC2WPLOCK in the FCW_CWP register */
#define FCW_CWP_Msk                           _UINT32_(0x05050505)                                 /* (FCW_CWP) Register Mask  */


/* -------- FCW_HSMINTENCLR : (FCW Offset: 0x80) (R/W 32) HSM NVM Interrupt Enable Clear Register -------- */
#define FCW_HSMINTENCLR_RESETVALUE            _UINT32_(0x00)                                       /*  (FCW_HSMINTENCLR) HSM NVM Interrupt Enable Clear Register  Reset Value */

#define FCW_HSMINTENCLR_DONE_Pos              _UINT32_(0)                                          /* (FCW_HSMINTENCLR) NVM Operation Done Interrupt Enable Bit Position */
#define FCW_HSMINTENCLR_DONE_Msk              (_UINT32_(0x1) << FCW_HSMINTENCLR_DONE_Pos)          /* (FCW_HSMINTENCLR) NVM Operation Done Interrupt Enable Bit Mask */
#define FCW_HSMINTENCLR_DONE(value)           (FCW_HSMINTENCLR_DONE_Msk & (_UINT32_(value) << FCW_HSMINTENCLR_DONE_Pos)) /* Assigment of value for DONE in the FCW_HSMINTENCLR register */
#define FCW_HSMINTENCLR_KEYERR_Pos            _UINT32_(1)                                          /* (FCW_HSMINTENCLR) Key Error Interrupt Enable Bit Position */
#define FCW_HSMINTENCLR_KEYERR_Msk            (_UINT32_(0x1) << FCW_HSMINTENCLR_KEYERR_Pos)        /* (FCW_HSMINTENCLR) Key Error Interrupt Enable Bit Mask */
#define FCW_HSMINTENCLR_KEYERR(value)         (FCW_HSMINTENCLR_KEYERR_Msk & (_UINT32_(value) << FCW_HSMINTENCLR_KEYERR_Pos)) /* Assigment of value for KEYERR in the FCW_HSMINTENCLR register */
#define FCW_HSMINTENCLR_CFGERR_Pos            _UINT32_(2)                                          /* (FCW_HSMINTENCLR) Configuration Error Interrupt Enable Bit Position */
#define FCW_HSMINTENCLR_CFGERR_Msk            (_UINT32_(0x1) << FCW_HSMINTENCLR_CFGERR_Pos)        /* (FCW_HSMINTENCLR) Configuration Error Interrupt Enable Bit Mask */
#define FCW_HSMINTENCLR_CFGERR(value)         (FCW_HSMINTENCLR_CFGERR_Msk & (_UINT32_(value) << FCW_HSMINTENCLR_CFGERR_Pos)) /* Assigment of value for CFGERR in the FCW_HSMINTENCLR register */
#define FCW_HSMINTENCLR_FIFOERR_Pos           _UINT32_(3)                                          /* (FCW_HSMINTENCLR) FIFO Underrun during Row Write Interrupt Enable Bit Position */
#define FCW_HSMINTENCLR_FIFOERR_Msk           (_UINT32_(0x1) << FCW_HSMINTENCLR_FIFOERR_Pos)       /* (FCW_HSMINTENCLR) FIFO Underrun during Row Write Interrupt Enable Bit Mask */
#define FCW_HSMINTENCLR_FIFOERR(value)        (FCW_HSMINTENCLR_FIFOERR_Msk & (_UINT32_(value) << FCW_HSMINTENCLR_FIFOERR_Pos)) /* Assigment of value for FIFOERR in the FCW_HSMINTENCLR register */
#define FCW_HSMINTENCLR_BUSERR_Pos            _UINT32_(4)                                          /* (FCW_HSMINTENCLR) AHB Bus Error during Row Write Interrupt Enable Bit Position */
#define FCW_HSMINTENCLR_BUSERR_Msk            (_UINT32_(0x1) << FCW_HSMINTENCLR_BUSERR_Pos)        /* (FCW_HSMINTENCLR) AHB Bus Error during Row Write Interrupt Enable Bit Mask */
#define FCW_HSMINTENCLR_BUSERR(value)         (FCW_HSMINTENCLR_BUSERR_Msk & (_UINT32_(value) << FCW_HSMINTENCLR_BUSERR_Pos)) /* Assigment of value for BUSERR in the FCW_HSMINTENCLR register */
#define FCW_HSMINTENCLR_WPERR_Pos             _UINT32_(5)                                          /* (FCW_HSMINTENCLR) Write Protection Error Interrupt Enable Bit Position */
#define FCW_HSMINTENCLR_WPERR_Msk             (_UINT32_(0x1) << FCW_HSMINTENCLR_WPERR_Pos)         /* (FCW_HSMINTENCLR) Write Protection Error Interrupt Enable Bit Mask */
#define FCW_HSMINTENCLR_WPERR(value)          (FCW_HSMINTENCLR_WPERR_Msk & (_UINT32_(value) << FCW_HSMINTENCLR_WPERR_Pos)) /* Assigment of value for WPERR in the FCW_HSMINTENCLR register */
#define FCW_HSMINTENCLR_OPERR_Pos             _UINT32_(6)                                          /* (FCW_HSMINTENCLR) NVMOP Error Interrupt Enable Bit Position */
#define FCW_HSMINTENCLR_OPERR_Msk             (_UINT32_(0x1) << FCW_HSMINTENCLR_OPERR_Pos)         /* (FCW_HSMINTENCLR) NVMOP Error Interrupt Enable Bit Mask */
#define FCW_HSMINTENCLR_OPERR(value)          (FCW_HSMINTENCLR_OPERR_Msk & (_UINT32_(value) << FCW_HSMINTENCLR_OPERR_Pos)) /* Assigment of value for OPERR in the FCW_HSMINTENCLR register */
#define FCW_HSMINTENCLR_SECERR_Pos            _UINT32_(7)                                          /* (FCW_HSMINTENCLR) Security Violation Error Interrupt Enable Bit Position */
#define FCW_HSMINTENCLR_SECERR_Msk            (_UINT32_(0x1) << FCW_HSMINTENCLR_SECERR_Pos)        /* (FCW_HSMINTENCLR) Security Violation Error Interrupt Enable Bit Mask */
#define FCW_HSMINTENCLR_SECERR(value)         (FCW_HSMINTENCLR_SECERR_Msk & (_UINT32_(value) << FCW_HSMINTENCLR_SECERR_Pos)) /* Assigment of value for SECERR in the FCW_HSMINTENCLR register */
#define FCW_HSMINTENCLR_HTDPGM_Pos            _UINT32_(8)                                          /* (FCW_HSMINTENCLR) High Temperature Detect Error Interrupt Enable Bit Position */
#define FCW_HSMINTENCLR_HTDPGM_Msk            (_UINT32_(0x1) << FCW_HSMINTENCLR_HTDPGM_Pos)        /* (FCW_HSMINTENCLR) High Temperature Detect Error Interrupt Enable Bit Mask */
#define FCW_HSMINTENCLR_HTDPGM(value)         (FCW_HSMINTENCLR_HTDPGM_Msk & (_UINT32_(value) << FCW_HSMINTENCLR_HTDPGM_Pos)) /* Assigment of value for HTDPGM in the FCW_HSMINTENCLR register */
#define FCW_HSMINTENCLR_BORERR_Pos            _UINT32_(12)                                         /* (FCW_HSMINTENCLR) Brown Out Detect Error Interrupt Enable Bit Position */
#define FCW_HSMINTENCLR_BORERR_Msk            (_UINT32_(0x1) << FCW_HSMINTENCLR_BORERR_Pos)        /* (FCW_HSMINTENCLR) Brown Out Detect Error Interrupt Enable Bit Mask */
#define FCW_HSMINTENCLR_BORERR(value)         (FCW_HSMINTENCLR_BORERR_Msk & (_UINT32_(value) << FCW_HSMINTENCLR_BORERR_Pos)) /* Assigment of value for BORERR in the FCW_HSMINTENCLR register */
#define FCW_HSMINTENCLR_WRERR_Pos             _UINT32_(13)                                         /* (FCW_HSMINTENCLR) Write Error Interrupt Enable Bit Position */
#define FCW_HSMINTENCLR_WRERR_Msk             (_UINT32_(0x1) << FCW_HSMINTENCLR_WRERR_Pos)         /* (FCW_HSMINTENCLR) Write Error Interrupt Enable Bit Mask */
#define FCW_HSMINTENCLR_WRERR(value)          (FCW_HSMINTENCLR_WRERR_Msk & (_UINT32_(value) << FCW_HSMINTENCLR_WRERR_Pos)) /* Assigment of value for WRERR in the FCW_HSMINTENCLR register */
#define FCW_HSMINTENCLR_Msk                   _UINT32_(0x000031FF)                                 /* (FCW_HSMINTENCLR) Register Mask  */


/* -------- FCW_HSMINTENSET : (FCW Offset: 0x84) (R/W 32) HSM NVM Interrupt Enable SET Register -------- */
#define FCW_HSMINTENSET_RESETVALUE            _UINT32_(0x00)                                       /*  (FCW_HSMINTENSET) HSM NVM Interrupt Enable SET Register  Reset Value */

