Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_sg01_cult/pic32ck_sg01_cult_tz_getting_started/firmware/src/packs/PIC32CK2051SG01144_DFP/component/fcw.h
/* -------- FCW_HSMCWP : (FCW Offset: 0x8C) (R/W 32) HSM CFG Write Protect Register -------- */
#define FCW_HSMCWP_RESETVALUE                 _UINT32_(0xF000)                                     /*  (FCW_HSMCWP) HSM CFG Write Protect Register  Reset Value */

#define FCW_HSMCWP_HCWP_Pos                   _UINT32_(12)                                         /* (FCW_HSMCWP) HSM CFG Page Write Protect Bits Position */
#define FCW_HSMCWP_HCWP_Msk                   (_UINT32_(0xF) << FCW_HSMCWP_HCWP_Pos)               /* (FCW_HSMCWP) HSM CFG Page Write Protect Bits Mask */
#define FCW_HSMCWP_HCWP(value)                (FCW_HSMCWP_HCWP_Msk & (_UINT32_(value) << FCW_HSMCWP_HCWP_Pos)) /* Assigment of value for HCWP in the FCW_HSMCWP register */
#define FCW_HSMCWP_HCWPLOCK_Pos               _UINT32_(28)                                         /* (FCW_HSMCWP) HSMCWP Register Lock Bit Position */
#define FCW_HSMCWP_HCWPLOCK_Msk               (_UINT32_(0xF) << FCW_HSMCWP_HCWPLOCK_Pos)           /* (FCW_HSMCWP) HSMCWP Register Lock Bit Mask */
#define FCW_HSMCWP_HCWPLOCK(value)            (FCW_HSMCWP_HCWPLOCK_Msk & (_UINT32_(value) << FCW_HSMCWP_HCWPLOCK_Pos)) /* Assigment of value for HCWPLOCK in the FCW_HSMCWP register */
#define FCW_HSMCWP_Msk                        _UINT32_(0xF000F000)                                 /* (FCW_HSMCWP) Register Mask  */


/* -------- FCW_HSMLDAT : (FCW Offset: 0x90) (R/W 32) HSM Tamper Lower Overwrite Data Register -------- */
#define FCW_HSMLDAT_RESETVALUE                _UINT32_(0xFFFFFFFF)                                 /*  (FCW_HSMLDAT) HSM Tamper Lower Overwrite Data Register  Reset Value */

#define FCW_HSMLDAT_Msk                       _UINT32_(0x00000000)                                 /* (FCW_HSMLDAT) Register Mask  */


/* -------- FCW_HSMUDAT : (FCW Offset: 0xB0) (R/W 32) HSM Tamper Upper Overwrite Data Register -------- */
#define FCW_HSMUDAT_RESETVALUE                _UINT32_(0xFFFFFFFF)                                 /*  (FCW_HSMUDAT) HSM Tamper Upper Overwrite Data Register  Reset Value */

#define FCW_HSMUDAT_Msk                       _UINT32_(0x00000000)                                 /* (FCW_HSMUDAT) Register Mask  */


/** \brief FCW register offsets definitions */
#define FCW_CTRLA_REG_OFST             _UINT32_(0x00)      /* (FCW_CTRLA) NVM Write Control Register Offset */
#define FCW_CTRLB_REG_OFST             _UINT32_(0x04)      /* (FCW_CTRLB) NVM Control B Register Offset */
#define FCW_MUTEX_REG_OFST             _UINT32_(0x08)      /* (FCW_MUTEX) NVM MUTEX Register Offset */
#define FCW_INTENCLR_REG_OFST          _UINT32_(0x0C)      /* (FCW_INTENCLR) NVM Interrupt Enable Clear Register Offset */
#define FCW_INTENSET_REG_OFST          _UINT32_(0x10)      /* (FCW_INTENSET) NVM Interrupt Enable SET Register Offset */
#define FCW_INTFLAG_REG_OFST           _UINT32_(0x14)      /* (FCW_INTFLAG) NVM Interrupt Flag Register Offset */
#define FCW_STATUS_REG_OFST            _UINT32_(0x18)      /* (FCW_STATUS) NVM Status Register Offset */
#define FCW_KEY_REG_OFST               _UINT32_(0x1C)      /* (FCW_KEY) SFR Unlock Register Offset */
#define FCW_ADDR_REG_OFST              _UINT32_(0x20)      /* (FCW_ADDR) Flash Address Register Offset */
#define FCW_SRCADDR_REG_OFST           _UINT32_(0x24)      /* (FCW_SRCADDR) Source Data Address Register Offset */
#define FCW_DATA_REG_OFST              _UINT32_(0x28)      /* (FCW_DATA) Flash Write Data Register Offset */
#define FCW_DATA0_REG_OFST             _UINT32_(0x28)      /* (FCW_DATA0) Flash Write Data Register Offset */
#define FCW_DATA1_REG_OFST             _UINT32_(0x2C)      /* (FCW_DATA1) Flash Write Data Register Offset */
#define FCW_DATA2_REG_OFST             _UINT32_(0x30)      /* (FCW_DATA2) Flash Write Data Register Offset */
#define FCW_DATA3_REG_OFST             _UINT32_(0x34)      /* (FCW_DATA3) Flash Write Data Register Offset */
#define FCW_DATA4_REG_OFST             _UINT32_(0x38)      /* (FCW_DATA4) Flash Write Data Register Offset */
#define FCW_DATA5_REG_OFST             _UINT32_(0x3C)      /* (FCW_DATA5) Flash Write Data Register Offset */
#define FCW_DATA6_REG_OFST             _UINT32_(0x40)      /* (FCW_DATA6) Flash Write Data Register Offset */
#define FCW_DATA7_REG_OFST             _UINT32_(0x44)      /* (FCW_DATA7) Flash Write Data Register Offset */
#define FCW_SWAP_REG_OFST              _UINT32_(0x48)      /* (FCW_SWAP) NVM Panel Swap Register Offset */
#define FCW_PWP_REG_OFST               _UINT32_(0x4C)      /* (FCW_PWP) PFM Write Protect Region 0 Offset */
#define FCW_PWP0_REG_OFST              _UINT32_(0x4C)      /* (FCW_PWP0) PFM Write Protect Region 0 Offset */
#define FCW_PWP1_REG_OFST              _UINT32_(0x50)      /* (FCW_PWP1) PFM Write Protect Region 0 Offset */
#define FCW_PWP2_REG_OFST              _UINT32_(0x54)      /* (FCW_PWP2) PFM Write Protect Region 0 Offset */
#define FCW_PWP3_REG_OFST              _UINT32_(0x58)      /* (FCW_PWP3) PFM Write Protect Region 0 Offset */
#define FCW_PWP4_REG_OFST              _UINT32_(0x5C)      /* (FCW_PWP4) PFM Write Protect Region 0 Offset */
#define FCW_PWP5_REG_OFST              _UINT32_(0x60)      /* (FCW_PWP5) PFM Write Protect Region 0 Offset */
#define FCW_PWP6_REG_OFST              _UINT32_(0x64)      /* (FCW_PWP6) PFM Write Protect Region 0 Offset */
#define FCW_PWP7_REG_OFST              _UINT32_(0x68)      /* (FCW_PWP7) PFM Write Protect Region 0 Offset */
#define FCW_LBWP_REG_OFST              _UINT32_(0x6C)      /* (FCW_LBWP) Lower BFM Write Protect Register Offset */
#define FCW_UBWP_REG_OFST              _UINT32_(0x70)      /* (FCW_UBWP) Upper BFM Write Protect Register Offset */
#define FCW_UOWP_REG_OFST              _UINT32_(0x74)      /* (FCW_UOWP) User OTP Write Protect Register Offset */
#define FCW_CWP_REG_OFST               _UINT32_(0x78)      /* (FCW_CWP) CFM Page Write Protect Register Offset */
#define FCW_HSMINTENCLR_REG_OFST       _UINT32_(0x80)      /* (FCW_HSMINTENCLR) HSM NVM Interrupt Enable Clear Register Offset */
#define FCW_HSMINTENSET_REG_OFST       _UINT32_(0x84)      /* (FCW_HSMINTENSET) HSM NVM Interrupt Enable SET Register Offset */
#define FCW_HSMINTFLAG_REG_OFST        _UINT32_(0x88)      /* (FCW_HSMINTFLAG) HSM NVM Interrupt Flag Register Offset */
#define FCW_HSMCWP_REG_OFST            _UINT32_(0x8C)      /* (FCW_HSMCWP) HSM CFG Write Protect Register Offset */
#define FCW_HSMLDAT_REG_OFST           _UINT32_(0x90)      /* (FCW_HSMLDAT) HSM Tamper Lower Overwrite Data Register Offset */
#define FCW_HSMLDAT0_REG_OFST          _UINT32_(0x90)      /* (FCW_HSMLDAT0) HSM Tamper Lower Overwrite Data Register Offset */
#define FCW_HSMLDAT1_REG_OFST          _UINT32_(0x94)      /* (FCW_HSMLDAT1) HSM Tamper Lower Overwrite Data Register Offset */
#define FCW_HSMLDAT2_REG_OFST          _UINT32_(0x98)      /* (FCW_HSMLDAT2) HSM Tamper Lower Overwrite Data Register Offset */
#define FCW_HSMLDAT3_REG_OFST          _UINT32_(0x9C)      /* (FCW_HSMLDAT3) HSM Tamper Lower Overwrite Data Register Offset */
#define FCW_HSMLDAT4_REG_OFST          _UINT32_(0xA0)      /* (FCW_HSMLDAT4) HSM Tamper Lower Overwrite Data Register Offset */
#define FCW_HSMLDAT5_REG_OFST          _UINT32_(0xA4)      /* (FCW_HSMLDAT5) HSM Tamper Lower Overwrite Data Register Offset */
#define FCW_HSMLDAT6_REG_OFST          _UINT32_(0xA8)      /* (FCW_HSMLDAT6) HSM Tamper Lower Overwrite Data Register Offset */
#define FCW_HSMLDAT7_REG_OFST          _UINT32_(0xAC)      /* (FCW_HSMLDAT7) HSM Tamper Lower Overwrite Data Register Offset */
#define FCW_HSMUDAT_REG_OFST           _UINT32_(0xB0)      /* (FCW_HSMUDAT) HSM Tamper Upper Overwrite Data Register Offset */
#define FCW_HSMUDAT0_REG_OFST          _UINT32_(0xB0)      /* (FCW_HSMUDAT0) HSM Tamper Upper Overwrite Data Register Offset */
#define FCW_HSMUDAT1_REG_OFST          _UINT32_(0xB4)      /* (FCW_HSMUDAT1) HSM Tamper Upper Overwrite Data Register Offset */
#define FCW_HSMUDAT2_REG_OFST          _UINT32_(0xB8)      /* (FCW_HSMUDAT2) HSM Tamper Upper Overwrite Data Register Offset */
#define FCW_HSMUDAT3_REG_OFST          _UINT32_(0xBC)      /* (FCW_HSMUDAT3) HSM Tamper Upper Overwrite Data Register Offset */
#define FCW_HSMUDAT4_REG_OFST          _UINT32_(0xC0)      /* (FCW_HSMUDAT4) HSM Tamper Upper Overwrite Data Register Offset */
#define FCW_HSMUDAT5_REG_OFST          _UINT32_(0xC4)      /* (FCW_HSMUDAT5) HSM Tamper Upper Overwrite Data Register Offset */
#define FCW_HSMUDAT6_REG_OFST          _UINT32_(0xC8)      /* (FCW_HSMUDAT6) HSM Tamper Upper Overwrite Data Register Offset */
#define FCW_HSMUDAT7_REG_OFST          _UINT32_(0xCC)      /* (FCW_HSMUDAT7) HSM Tamper Upper Overwrite Data Register Offset */

